%% 计算2015年 乍得
%{
    降雨量总值	温差	自然灾害发生数	森林面积占地面积百分比	陆地及海洋保护区面积占比	
    农业增加值占GDP百分比	通货膨胀	经济指数4	人均GDP	外商直接投资净流入	
    基尼系数	人口压力DP10	难民人数RD11	@1564岁的人口占比	公共医疗卫生支出占比	
    入学率	财政赤字	国家合法性SL7	收到的净官方发展援助占比	
    免签国家数量	改善水源在城市的人口占比	粮食生产指数	净移民	@10派系精英FE2	@10人权HR9
%}

chad_factors = [
    3.40325	3.3178	4.06969	1.34509	2.09777	3.82412	2.10189	3.24429	1.88626	2.43816	1.90436	3.0207	3.8396	1.6906	0.90468	4.03362	3.21237	3.50058	2.53058	2.49053	1.40455	4.30066	3.39907	1.34816	1.36488
];
chad_ks = [0.2 0.25 0.2 0.25 0.1];

chad_frags = calc_frag_fun(chad_factors, chad_ks);

%% 计算2015年 伊拉克
iraq_factors = [
    1.75074	5.57388	4.6758	1.12216	-0.23861	1.67848	1.58675	2.64269	2.73169	3.70213	0.4828	1.69545	3.21562	3.22072	3.42202	3.23233	2.05755	3.37901	2.17186	1.75194	2.4706	2.87355	6.2145	4.052	4.66448
];
iraq_ks = [0.2 0.25 0.2 0.25 0.1];

iraq_frags = calc_frag_fun(iraq_factors, iraq_ks);

%% 计算2015年 意大利
italy_factors = [
    6.14219	4.36956	0.43299	4.48056	1.4288	1.68883	1.3938	1.89068	7.80772	8.34776	0.95818	-2.81043	0.26587	5.07539	6.16459	2.78897	2.05755	1.35292	1.09572	7.21752	3.73972	1.56341	4.25221	2.62893	2.11122
];
italy_ks = [0.1 0.3 0.2 0.3 0.1];

italy_frags = calc_frag_fun(italy_factors, italy_ks);

%% 计算2015年 博茨瓦纳
bwa_factors = [
    1.39842	1.75497	3.46357	3.06972	3.54512	1.67985	1.98429	2.11628	3.04555	2.47503	2.417	1.07699	1.11676	3.19983	2.34052	2.91081	1.36466	1.39344	1.12607	3.41377	3.41398	1.61501	1.77489	3.11277	3.32893
];
bwa_ks = [0.1 0.3 0.2 0.3 0.1];
bwa_frags = calc_frag_fun(bwa_factors, bwa_ks);